Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 416, 416, 3) 0                                            
__________________________________________________________________________________________________
conv_block (ConvBlock)          (None, 208, 208, 16) 496         input_1[0][0]                    
__________________________________________________________________________________________________
bneck (Bneck)                   (None, 104, 104, 16) 976         conv_block[0][0]                 
__________________________________________________________________________________________________
bneck_1 (Bneck)                 (None, 52, 52, 24)   4200        bneck[0][0]                      
__________________________________________________________________________________________________
bneck_2 (Bneck)                 (None, 52, 52, 24)   5816        bneck_1[0][0]                    
__________________________________________________________________________________________________
bneck_3 (Bneck)                 (None, 26, 26, 40)   14080       bneck_2[0][0]                    
__________________________________________________________________________________________________
bneck_4 (Bneck)                 (None, 26, 26, 40)   56080       bneck_3[0][0]                    
__________________________________________________________________________________________________
bneck_5 (Bneck)                 (None, 26, 26, 40)   56080       bneck_4[0][0]                    
__________________________________________________________________________________________________
bneck_6 (Bneck)                 (None, 26, 26, 48)   21912       bneck_5[0][0]                    
__________________________________________________________________________________________________
bneck_7 (Bneck)                 (None, 26, 26, 48)   29136       bneck_6[0][0]                    
__________________________________________________________________________________________________
bneck_8 (Bneck)                 (None, 13, 13, 96)   92832       bneck_7[0][0]                    
__________________________________________________________________________________________________
bneck_9 (Bneck)                 (None, 13, 13, 96)   295872      bneck_8[0][0]                    
__________________________________________________________________________________________________
bneck_10 (Bneck)                (None, 13, 13, 96)   295872      bneck_9[0][0]                    
__________________________________________________________________________________________________
bneck_11 (Bneck)                (None, 13, 13, 96)   60576       bneck_10[0][0]                   
__________________________________________________________________________________________________
bneck_12 (Bneck)                (None, 13, 13, 96)   60576       bneck_11[0][0]                   
__________________________________________________________________________________________________
bneck_13 (Bneck)                (None, 13, 13, 48)   46560       bneck_12[0][0]                   
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 26, 26, 48)   0           bneck_13[0][0]                   
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 26, 26, 96)   0           up_sampling2d[0][0]              
                                                                 bneck_7[0][0]                    
__________________________________________________________________________________________________
bneck_14 (Bneck)                (None, 26, 26, 96)   60576       concatenate[0][0]                
__________________________________________________________________________________________________
bneck_15 (Bneck)                (None, 26, 26, 96)   60576       bneck_14[0][0]                   
__________________________________________________________________________________________________
bneck_16 (Bneck)                (None, 26, 26, 48)   46560       bneck_15[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 52, 52, 48)   0           bneck_16[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 52, 52, 72)   0           up_sampling2d_1[0][0]            
                                                                 bneck_2[0][0]                    
__________________________________________________________________________________________________
bneck_17 (Bneck)                (None, 52, 52, 96)   53664       concatenate_1[0][0]              
__________________________________________________________________________________________________
bneck_18 (Bneck)                (None, 52, 52, 96)   60576       bneck_17[0][0]                   
__________________________________________________________________________________________________
conv_block_27 (ConvBlock)       (None, 13, 13, 288)  249984      bneck_12[0][0]                   
__________________________________________________________________________________________________
conv_block_35 (ConvBlock)       (None, 26, 26, 288)  249984      bneck_15[0][0]                   
__________________________________________________________________________________________________
conv_block_43 (ConvBlock)       (None, 52, 52, 288)  249984      bneck_18[0][0]                   
__________________________________________________________________________________________________
conv_block_28 (ConvBlock)       (None, 13, 13, 75)   21675       conv_block_27[0][0]              
__________________________________________________________________________________________________
conv_block_36 (ConvBlock)       (None, 26, 26, 75)   21675       conv_block_35[0][0]              
__________________________________________________________________________________________________
conv_block_44 (ConvBlock)       (None, 52, 52, 75)   21675       conv_block_43[0][0]              
__________________________________________________________________________________________________
lambda (Lambda)                 (None, None, None, 3, 25) 0      conv_block_28[0][0]              
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, None, None, 3, 25) 0      conv_block_36[0][0]              
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, None, None, 3, 25) 0      conv_block_44[0][0]              
==================================================================================================
Total params: 2,137,993
Trainable params: 2,114,713
Non-trainable params: 23,280
__________________________________________________________________________________________________
